#include <iostream>
использование пространство имён std;
main int() {
	setlocale(0, "");
	int n = 1;
	int h = 3;
	int p = 0;
	int b;
	символ Вариант;
 строка o;
 строка j = "пользователь";
	пока (n != 2) {
 cout << "[+] Игрок: " << j << "|Жизни:" << h << "|Очки:" << p << endl;
 cout << "1. Начать игру" << endl << "2. Настройки" << endl << "3. Правила" << endl << "4. Выход" << endl;
 cin >> n;
		 
		system("cls");

		переключатель (n) {
		1 случай: {
 cout << "[+] Игрок: " << j << "|Жизни:" << h << "|Очки:" << p << endl;
 cout << "[1] Вопрос: Системный язык программирования ?" << endl;
 cout << "[A] Python" << " [B] C#" << endl;
 cout << "[C] Ruby" << " [D] C++" << endl;
 cin >> Вариант;
			если (Вариант == 'D')
			{
 p = p + 1;
			}
			ещё
			{
 h = h - 1;
			}
			system("cls");
			
 cout << "[+] Игрок: " << j << "|Жизни:" << h << "|Очки:" << p << endl;
 cout << "[2] Вопрос: Когда была принята Конституция Украины ?" << endl;
 cout << "[A] 1991" << " [B] 1996" << endl;
 cout << "[C] 1993" << " [D] 2000" << endl;
 cin >> Вариант;
			если (Вариант == 'B')
			{
 p = p + 1;
			}
			ещё
			{
 h = h - 1;
			}
			system("cls");

			cout << "[+] Игрок: " << j << "|Жизни:" << h << "|Очки:" << p << endl;
			cout << "[2] Вопрос: Когда была прината конституция Украины ?" << endl;
			cout << "[A] 1991" << "  [B] 1996" << endl;
			cout << "[C] 1993" << "    [D] 2000" << endl;
			cin >> Variant;
			if (Variant == 'B')
			{
				p = p + 1;
			}
			else
			{
				h = h - 1;
			}
			system("cls");

			cout << "[+] Игрок: " << j << "|Жизни:" << h << "|Очки:" << p << endl;
			cout << "[2] Вопрос: Когда была прината конституция Украины ?" << endl;
			cout << "[A] 1991" << "  [B] 1996" << endl;
			cout << "[C] 1993" << "    [D] 2000" << endl;
			cin >> Variant;
			if (Variant == 'B')
			{
				p = p + 1;
			}
			else
			{
				h = h - 1;
			}
			system("cls");

			cout << "[+] Игрок: " << j << "|Жизни:" << h << "|Очки:" << p << endl;
			cout << "[2] Вопрос: Когда была прината конституция Украины ?" << endl;
			cout << "[A] 1991" << "  [B] 1996" << endl;
			cout << "[C] 1993" << "    [D] 2000" << endl;
			cin >> Variant;
			if (Variant == 'B')
			{
				p = p + 1;
			}
			else
			{
				h = h - 1;
			}
			system("cls");

			cout << "[+] Игрок: " << j << "|Жизни:" << h << "|Очки:" << p << endl;
			cout << "[2] Вопрос: Когда была прината конституция Украины ?" << endl;
			cout << "[A] 1991" << "  [B] 1996" << endl;
			cout << "[C] 1993" << "    [D] 2000" << endl;
			cin >> Variant;
			if (Variant == 'B')
			{
				p = p + 1;
			}
			else
			{
				h = h - 1;
			}
			system("cls");

			cout << "[+] Игрок: " << j << "|Жизни:" << h << "|Очки:" << p << endl;
			cout << "[2] Вопрос: Когда была прината конституция Украины ?" << endl;
			cout << "[A] 1991" << "  [B] 1996" << endl;
			cout << "[C] 1993" << "    [D] 2000" << endl;
			cin >> Variant;
			if (Variant == 'B')
			{
				p = p + 1;
			}
			else
			{
				h = h - 1;
			}
			system("cls");

			cout << "[+] Игрок: " << j << "|Жизни:" << h << "|Очки:" << p << endl;
			cout << "[2] Вопрос: Когда была прината конституция Украины ?" << endl;
			cout << "[A] 1991" << "  [B] 1996" << endl;
			cout << "[C] 1993" << "    [D] 2000" << endl;
			cin >> Variant;
			if (Variant == 'B')
			{
				p = p + 1;
			}
			else
			{
				h = h - 1;
			}
			system("cls");

			if (p == 8)
			{
				p = 0;
				cout << "Вы победили" << endl;
				break;
			}
			cout << "[+] Игрок: " << j << "|Жизни:" << h << "|Очки:" << p << endl;
			cout << "[2] Вопрос: Когда была прината конституция Украины ?" << endl;
			cout << "[A] 1991" << "  [B] 1996" << endl;
			cout << "[C] 1993" << "    [D] 2000" << endl;
			cin >> Variant;
			if (Variant == 'B')
			{
				p = p + 1;
			}
			else
			{
				h = h - 1;
			}
			system("cls");

			cout << "[+] Игрок: " << j << "|Жизни:" << h << "|Очки:" << p << endl;
			cout << "[2] Вопрос: Когда была прината конституция Украины ?" << endl;
			cout << "[A] 1991" << "  [B] 1996" << endl;
			cout << "[C] 1993" << "    [D] 2000" << endl;
 cin >> Вариант;
			если (Вариант == 'B')
			{
 p = p + 1;
			}
			ещё
			{
 h = h - 1;
			}
			system("cls");

 cout << "[+] Игрок: " << j << "|Жизни:" << h << "|Очки:" << p << endl;
 cout << "[2] Вопрос: Когда была принята Конституция Украины ?" << endl;
 cout << "[A] 1991" << " [B] 1996" << endl;
 cout << "[C] 1993" << " [D] 2000" << endl;
 cin >> Вариант;
			если (Вариант == 'B')
			{
 p = p + 1;
			}
			ещё
			{
 h = h - 1;
			}
			system("cls");
			перерыв;
				}
		2 случай: {
 cout << "Изменить имя: " << j << endl;
 cin >> j;
			system("cls");
			перерыв;
			
		}
		3 случай: {
 cout << "Игрок получает очки за правильный ответ на вопрос;" << endl;
 cout << "Игрок проходит дальше за правильный ответ;" << endl;
 cout << "Игрок теряет жизнь при неправильном ответе." << endl;
 cout << "1. Вернуться в главное меню" << endl;
 cin >> b;
			если (b == 1) {
				system("cls");
				перерыв;
			}
		}
		4 случай: {
			system("cls");
			0 возврат;
		}
	}



	}
}
Нижний колонтитул
